<?php

namespace App\Services;

class ErrorCode
{
    private $err = [
        0 => '成功',
        1 => '資料填寫與規格不符',
        2 => '必填資料未填',
        3 => 'email已註冊',
        4 => '電話已註冊',
        5 => '系統錯誤,請重新登入',
        6 => '重複登入,另一裝置請重複登入',
        7 => '短時間內登入次數過多',
        8 => '帳號或密碼錯誤',
        9 => 'token錯誤',
        10 => '未登入',
        11 => '餐廳已停用',
        12 => '請先訂餐且在24小時內評論',
        13 => '未訂餐請勿評論',
        14 => '已評論過',
        15 => '重複新增我的最愛',
        16 => '查無此餐廳',
        17 => '餐廳未營業',
        18 => '錢包餘額不足',
        19 => '查無此訂單',
        20 => '金額錯誤',
        21 => '請勿混單',
        22 => '同張訂單內請選擇同餐廳餐點',
        23 => '無效的範圍',
        24 => '查無此餐點',
        25 => '餐點已停用',
        26 => '系統錯誤',
        27 => '訂單總金額錯誤',
        28 => '超過最大我的最愛筆數',
        29 => '請重新登入',
        30 => '菜單資訊有誤',
        31 => '就裝置以登出,請重新登入',
        32 => '登入時間過久,請重新登入',
        33 => '請填入正確付款方式',
        34 => '訂單傳送失敗'
    ];
    private $keys = [];
    public function __construct()
    {
        $this->keys = array_keys($this->err);
    }
    public function getErrCode()
    {
        return $this->err;
    }
    public function getErrKey()
    {
        return $this->keys;
    }
}
