<?php

namespace App;

class ErrorCodeService
{
    public $err = [
        '0' => '成功', //成功
        '1' => '資料填寫與規格不符', //資料填寫與規格不符
        '2' => '必填資料未填', //
        '3' =>'email已註冊', //
        '4' =>'電話已註冊', //
        '5' =>'系統錯誤,請重新登入', //
        '6' =>'已登入', //
        '7' =>'短時間內登入次數過多', //
        '8' =>'帳號或密碼錯誤', //
        '9' =>'token錯誤', //
        '11' => '餐廳已停用', //
        '15' => '重複新增我的最愛', //
        '16' => '查無此餐廳', //
        '17' => '餐廳未營業', //
        '18' => '錢包餘額不足', //
        '19' => '查無此訂單', //
        '20' => '金額錯誤', //
        '22' => '同張訂單內請選擇同餐廳餐點', //
        '23' => '無效的範圍', //
        '24' => '查無此餐點', //
        '25' => '餐點已停用', //
        '26' => '系統錯誤', //
        '30' => '菜單資訊有誤' //
    ];
}
